Tekla.Structures.Model.ReferenceModel.VisibilityEnum
The visibility type.

Tekla.Structures.Model.ReferenceModel.VisibilityEnum.HIDDEN
The reference model is invisible in the model.

Tekla.Structures.Model.ReferenceModel.VisibilityEnum.VISIBLE
The reference model is visible in the model.